Autodesk.Revit.DB.ExternalResourceReference.CreateLocalResource(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ExternalResourceType,Autodesk.Revit.DB.ModelPath,Autodesk.Revit.DB.PathType)
Creates an ExternalResourceReference representing a local file managed
by Revit's built-in server.
doc:
The document containing the reference. If the PathType is relative,
the path will be made relative to the location of this Document. (If
this Document belongs to a workshared model,
the reference will be relative to the central model.)
resourceType:
The type of the external resource.
path:
A path to the external file. This path must be absolute. If the PathType is
relative, then Revit will relativize the path according to the location
of the given Document.
pathType:
An enum indicating the type of path which the ExternalResourceReference should use.
The PathType must be PathType.Server if the reference is to a Revit model on
Revit Server. The PathType must be PathType.Absolute if the reference is local
but the host model or host's central model are on Revit Server.
Returns:
The newly-created ExternalResourceReference.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The PathType.Enum value is not valid for this resource type or Document location.
PathType.Content is not valid for Revit links. The PathType must be PathType.Server
if the resource is on Revit Server and is only valid for Revit links. The PathType
must be PathType.Absolute if the host document or the host document's central model
are on Revit Server.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2015